## **[MySQL SELECT](https://www.mysqltutorial.org/mysql-select-statement-query-data.aspx)**

Use the basic form of the MySQL SELECT statement to query data from a table.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL SELECT statement

syntax:

SELECT select_list
FROM table_name;

### MySQL SELECT statement examples

#### A) Using the MySQL SELECT statement to retrieve data from a single column example

- mysql code:

In [3]:
string = '''
select lastName
from employees;
'''

(pd
 .read_sql(string, engine)
 .head()
)

    lastName
0     Murphy
1  Patterson
2   Firrelli
3  Patterson
4     Bondur

- pandas code:

In [4]:
(pd
 .read_sql_table('employees', engine, columns=['lastName'])
 .head()
)

    lastName
0     Murphy
1  Patterson
2   Firrelli
3  Patterson
4     Bondur

#### B) Using the MySQL SELECT statement to query data from multiple columns example

- mysql code

In [5]:
string = '''
select
    lastName,
    firstName,
    jobTitle
from
    employees;
'''

(pd
 .read_sql(string, engine)
 .head()
)

    lastName firstName              jobTitle
0     Murphy     Diane             President
1  Patterson      Mary              VP Sales
2   Firrelli      Jeff          VP Marketing
3  Patterson   William  Sales Manager (APAC)
4     Bondur    Gerard   Sale Manager (EMEA)

- pandas code:

In [6]:
(pd
 .read_sql_table('employees', engine,
                 columns=['lastName', 'firstName', 'jobTitle'])
 .head()
)

    lastName firstName              jobTitle
0     Murphy     Diane             President
1  Patterson      Mary              VP Sales
2   Firrelli      Jeff          VP Marketing
3  Patterson   William  Sales Manager (APAC)
4     Bondur    Gerard   Sale Manager (EMEA)

#### C) Using the MySQL SELECT statement to retrieve data from all columns example

- mysql code:

In [7]:
string = '''
select *
from employees;
'''

(pd
 .read_sql(string, engine)
 .head()
)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

- pandas code:

In [8]:
(pd
 .read_sql_table('employees', engine)
 .head()
)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)